lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC43xx.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_LPC18xx.c
 *      Purpose: CAN Driver, Hardware specific module for NXP LPC43xx
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <LPC43xx.h>


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o0> C_CAN0 Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as BASE_APB3_CLK
// <o1> C_CAN1 Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as BASE_APB1_CLK
#define C_CAN0_CLK           180000000
#define C_CAN1_CLK           180000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 * Functions implemented in this module and used externally:
 *         CAN_ERROR CAN_hw_testmode    (U32 ctrl, U32 testmode);
 *         CAN_ERROR CAN_hw_setup       (U32 ctrl);
 *         CAN_ERROR CAN_hw_init        (U32 ctrl, U32 baudrate);
 *         CAN_ERROR CAN_hw_start       (U32 ctrl);
 *         CAN_ERROR CAN_hw_tx_empty    (U32 ctrl);
 *         CAN_ERROR CAN_hw_wr          (U32 ctrl, CAN_msg *msg);
 *         CAN_ERROR CAN_hw_set         (U32 ctrl, CAN_msg *msg);
 *         CAN_ERROR CAN_hw_rx_object   (U32 ctrl, U32 ch, U32 id, U32 object_para);
 *         CAN_ERROR CAN_hw_tx_object   (U32 ctrl, U32 ch,         U32 object_para);
 *
 * Functions implemented in this module and used only in this module:
 *  static void      CAN_set_timing     (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp)
 *  static CAN_ERROR CAN_hw_set_baudrate(U32 ctrl, U32 baudrate)
 *  static void      CAN_hw_rd          (U32 ctrl, U32 ch, CAN_msg *msg)
 *  Interrupt function(s)
 *---------------------------------------------------------------------------*/

/* CAN Controller Register Addresses                                         */
LPC_C_CANn_Type *CAN_CTRL[] = { (LPC_C_CANn_Type *)LPC_C_CAN0_BASE, (LPC_C_CANn_Type *)LPC_C_CAN1_BASE };

/* Global variables                                                          */
U32 tx_mo [2] = { 0 };
U32 rx_mo [2] = { 0 };
U32 rtr_mo[2] = { 0 };


/************************* Auxiliary Functions *******************************/

/*--------------------------- CAN_set_timing --------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              tseg1:      Specifies Time Segment before the sample point
 *              tseg2:      Time Segment after the sample point
 *              sjw:        Synchronisation Jump Width
 *              brp:        Baud Rate Prescaler
 *
 *---------------------------------------------------------------------------*/

static void CAN_set_timing (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp) {
  LPC_C_CANn_Type *CANx = CAN_CTRL[ctrl-1];
  U8  brpe;
  
  CANx->CLKDIV = 1;                   /* PCLK = C_CANx_CLK / 2               */
  brp  /= 2;

  brpe  = (brp >> 6) & 0x0F;
  brp  &= 0x3F;

  CANx->BT   = (((tseg2-1) & 0x07) << 12) | (((tseg1-1) & 0x0F) << 8) | ((((sjw-1) & 0x03) << 6) | ((brp-1) & 0x3F));
  CANx->BRPE = brpe;
}


/*------------------------ CAN_hw_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {

  /* Load the baudrate register BT 
     so that sample point is at about 70% bit time from bit start 
     TSEG1 = 6, TSEG2 = 3 SJW = 3 => 1 CAN bit = 10 TQ, sample at 70%        */

  CAN_set_timing(ctrl, 6, 3, 3, (((ctrl == 1) ? C_CAN0_CLK : C_CAN1_CLK) / 10) / baudrate);

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {
  switch (ctrl) {
    case 1:
      #if USE_CAN_CTRL1 == 1
        /* Enable clock for C_CAN0                                           */
        LPC_CGU->BASE_APB3_CLK = (0    <<  0) |   /* Disable Power-down      */
                                 (1    << 11) |   /* Autoblock En            */
                                 (0x09 << 24) ;   /* Clock source PLL1       */
        LPC_CCU1->CLK_APB3_CAN0_CFG = 1;          /* Run enable              */
        while (!(LPC_CCU1->CLK_APB3_CAN0_CFG&1)); /* Wait for run enable     */

        /* Enable C_CAN0 pins                                                */
        LPC_SCU->SFSP3_1  =        2  | /* P3_1 - CAN0_RD                    */
                             (1 << 4) | /*        EPUN = 1 (disable pull-up) */
                             (1 << 6) ; /*        EZI  = 1 (input buffer en) */
        LPC_SCU->SFSP3_2  =        2  | /* P3_2 - CAN0_TD                    */
                             (1 << 4) ; /*        EPUN = 1 (disable pull-up) */

