lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC43xx.c
CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {

  return CAN_NOT_IMPLEMENTED_ERROR;
}


/************************* Interrupt Functions *******************************/

/*--------------------------- CANx_IRQHandler -------------------------------
 *
 *  CAN interrupt functions 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *---------------------------------------------------------------------------*/

#define CTRL0                 0
#define CTRL                  1
#define CANc                  LPC_C_CAN0

void CAN0_IRQHandler (void) {
  CAN_msg *ptrmsg;
  U32      ch, stat, nd;
  
  while (1) {
    ch   = CANc->INT;
    if (!ch) 
      break;
    nd   = (((U32)CANc->ND2) << 16) | CANc->ND1;
    stat = CANc->STAT;
    if (ch && ch <= 0x20) {
      if (rtr_mo[CTRL0] & (1 << (ch-1))) {     /* If RTR transmitted or 
                                                  received                   */
        if (tx_mo[CTRL0] & (1 << (ch-1))) {    
                                               /* If RTR received and data 
                                                  should be sent as answer   */
          rtr_mo[CTRL0] &= ~(1 << (ch-1));     /* Just remove RTR bit and  
                                                  automatically answer with 
                                                  prepared data              */
          CANc->STAT = stat & ~(1 << 4);       /* Clear RX status            */
        } else if (rx_mo[CTRL0] & (1 << (ch-1))) {
                                               /* If RTR transmitted and data 
                                                  should be received         */
          rtr_mo[CTRL0] &= ~(1 << (ch-1));     /* Just remove RTR bit and 
                                                  check if there is anything
                                                  else to be sent            */
          /* If there is a message in the mailbox ready for send, read the 
             message from the mailbox and send it                            */
          if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
            CAN_hw_wr (CTRL, ptrmsg);
            _free_box(CAN_mpool, ptrmsg);
          } else {
            isr_sem_send(wr_sem[CTRL0]);       /* Return a token back to sem */
          }
          CANc->STAT = stat & ~(1 << 3);       /* Clear TX status            */
        }
      }
      else if (tx_mo[CTRL0] & (1 << (ch-1))) { /* If data transmitted        */
        /* Release message object used for transmit                          */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_CMDMSK_R =  (1 <<  5);       /* Access only ARB bits       */
        CANc->IF2_CMDREQ   =   ch;             /* Read ARB bits              */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_ARB2    &= ~(1 << 15);       /* Clear MSGVAL bit in ARB2   */
        CANc->IF2_CMDMSK_W =   0xA0;           /* Access only ARB bits       */
        CANc->IF2_CMDREQ   =   ch;             /* Write ARB bits             */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_CMDMSK_R = (1 << 3);         /* Access only CLRINTPND bit  */
        CANc->IF2_CMDREQ   =   ch;             /* Clear INTPND bit           */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        tx_mo[CTRL0] &= ~(1 << (ch-1));        /* Clear obj as not used by tx*/
        /* If there is a message in the mailbox ready for send, read the 
           message from the mailbox and send it                              */
        if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
          CAN_hw_wr (CTRL, ptrmsg);
          _free_box(CAN_mpool, ptrmsg);
        } else {
          isr_sem_send(wr_sem[CTRL0]);/* Return a token back to semaphore    */
        }
        CANc->STAT = stat & ~(1 << 3);         /* Clear TX status            */
      }
      else if (rx_mo[CTRL0] & nd & (1 << (ch-1))) { 
                                               /* If receive msg obj int and 
                                                  new data awailable         */
        /* If the mailbox isn't full read the message from the hardware and
           send it to the message queue                                      */
        if (isr_mbx_check (MBX_rx_ctrl[CTRL0]) > 0)  {
          ptrmsg = _alloc_box (CAN_mpool);
          if (ptrmsg) {
            CAN_hw_rd (CTRL, ch, ptrmsg);      /* Read received message      */
            isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
          }
        }
        CANc->STAT = stat & ~(1 << 4);         /* Clear RX status            */
      }
    } else if (ch) {                           /* If error interrupt         */
      CANc->STAT = stat & ~(7 << 0);           /* Clear LEC status           */
    }
  }
}


#undef  CTRL0
#define CTRL0                 1
#undef  CTRL
#define CTRL                  2
#undef  CANc
#define CANc                  LPC_C_CAN1

void CAN1_IRQHandler (void) {
  CAN_msg *ptrmsg;
  U32      ch, stat, nd;
  
  while (1) {
    ch   = CANc->INT;
    if (!ch) 
      break;
    nd   = (((U32)CANc->ND2) << 16) | CANc->ND1;
    stat = CANc->STAT;
    if (ch && ch <= 0x20) {
      if (tx_mo[CTRL0] & (1 << (ch-1))) {      /* If transmit msg obj int    */
        /* Release message object used for transmit                          */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_CMDMSK_R =  (1 <<  5);       /* Access only ARB bits       */
        CANc->IF2_CMDREQ   =   ch;             /* Read ARB bits              */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_ARB2    &= ~(1 << 15);       /* Clear MSGVAL bit in ARB2   */
        CANc->IF2_CMDMSK_W =   0xA0;           /* Access only ARB bits       */
        CANc->IF2_CMDREQ   =   ch;             /* Write ARB bits             */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        CANc->IF2_CMDMSK_R = (1 << 3);         /* Access only CLRINTPND bit  */
        CANc->IF2_CMDREQ   =   ch;             /* Clear INTPND bit           */
        while (CANc->IF2_CMDREQ & 0x8000);     /* Wait while IF2 is busy     */
        tx_mo[CTRL0] &= ~(1 << (ch-1));        /* Clear obj as not used by tx*/
        /* If there is a message in the mailbox ready for send, read the 
           message from the mailbox and send it                              */
        if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
          CAN_hw_wr (CTRL, ptrmsg);
          _free_box(CAN_mpool, ptrmsg);
        } else {
          isr_sem_send(wr_sem[CTRL0]);/* Return a token back to semaphore    */
        }
        CANc->STAT = stat & ~(1 << 3);         /* Clear TX status            */
      }
      if (rx_mo[CTRL0] & nd & (1 << (ch-1))) { /* If receive msg obj int & nd*/
        /* If the mailbox isn't full read the message from the hardware and
           send it to the message queue                                      */
        if (isr_mbx_check (MBX_rx_ctrl[CTRL0]) > 0)  {
          ptrmsg = _alloc_box (CAN_mpool);
          if (ptrmsg) {
            CAN_hw_rd (CTRL, ch, ptrmsg);      /* Read received message      */
            isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
          }
        }
        CANc->STAT = stat & ~(1 << 4);         /* Clear RX status            */
      }
    } else if (ch) {                           /* If error interrupt         */
      CANc->STAT = stat & ~(7 << 0);           /* Clear LEC status           */
    }
  }
}


/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/

